Repository: common-repository/post-read-time
Catalog: languages/post-read-time-*.po
Languages: it_it

source: Post Read Time Setup
it_it: Tempo di lettura - Configurazione

source: Words per minutes
it_it: Parole al minuto

source: Average reading word per minutes (usually between 220 and 265)
it_it: Media delle parole lette in un minuto (solitamente fra 220 e 265)

source: Add time to read to posts
it_it: Aggiungi il tempo di lettura al post

source: Automatically add time to read to posts
it_it: Aggiunge automaticamente il tempo di lettura al post

source: Automatically insert time to read the post before the content
it_it: Aggiunge automaticamente il tempo di lettura prima del post

source: Calculate images
it_it: Calcola tempo per le immagini

source: Add time spent watching images
it_it: Aggiungi il tempo che occorre per vedere le immagini

source: Add the time spent watching images
it_it: Aggiungi il tempo che occorre per vedere le immagini

source: Show reading time on pages
it_it: Mostra il tempo di lettura sulle pagine

source: Calculate and show reading time also on pages
it_it: Calcola e mostra il tempo di lettura anche sulle pagine

source: Text before minutes
it_it: Testo prima dei minuti

source: Text to print before minutes
it_it: Testo da aggiungere prima dei minuti

source: Singular for minutes
it_it: Singolare per 'Minuti'

source: Singular to add after minutes
it_it: Singolare da aggiungere dopo i minuti

source: Plural for minutes
it_it: Plurale per 'Minuti'

source: Plural to add after minutes
it_it: Plurale da aggiungere dopo i minuti

source: Include default CSS
it_it: Includi CSS

source: Include default CSS, if you are using your own classes you can disable it
it_it: Include il CSS di default, se usi le tue classi puoi disabilitarlo

source: Minutes number CSS class
it_it: Classe per i minuti

source: Class to add to number of minutes
it_it: Classe CSS da aggiungere al numero di minuti

source: Minutes text CSS class
it_it: Classe per il testo 'Minuti'

source: Class to add to minutes text
it_it: Class CSS da aggiungere al testo 'Minuti'

source: Text before minutes CSS class
it_it: Classe per il testo prima dei minuti

source: Class to add to text before minutes
it_it: Classe CSS da aggiungere al testo che precede il numero dei minuti

source: Usage
it_it: Utilizzo

source: Activating the plugin will show a reading time (based on words and images) just above the content of the post. It will be formatted according included CSS, but you can disable default CSS and assign you own classes above; every piece of the "Reading Time" sentence has its own class. Also you can change the "Reading Time:" word and the word displayed after the minutes (both in singular an plural)<br>if you need more control, the plugin offer two function you can include in your theme: <pre>&lt;?php get_time_in_minutes($id_of_post); ?&gt;</pre> that retrieve the reading time for a post and <pre>&lt;?php time_in_minutes($id_of_post); ?&gt;</pre>that print out the time in minutes<br><br><b>Shortcode</b><br>Using the following shortcode<pre>['post_read_time']</pre>inside a post or a page, it will print out the read time in minutes of the current post or page.
it_it: Attivandolo, il plugin mostrerà il tempo di lettura (calcolandolo i base al testo e alle immagine) Appena sopra il contenuto del post. Questo testo sarà formattato con i CSS inclusi che possono essere disabilitati assegnando le proprie classi; ogni parte della frase "Tempo di lettura" ha una propria classe. Può inoltre essere modificata la frase "Tempo di lettura:" e le parole mostrare dopo i minuti (al singolare e al pluraleSe serve maggior controllo, il plugin offre due funzioni che possono essere inserite all'interno del proprio tema: <pre>&lt;?php get_time_in_minutes($id_of_post); ?&gt;</pre>che calcola il tempo di lettura per un post e <pre>&lt;?php time_in_minutes($id_of_post); ?&gt;</pre>che stampa il tempo di lettura del post<br><br><b>Shortcode</b><br>Utilizzando il seguente shortcode<pre>['post_read_time']</pre>in un post o una pagina, verrà mostrato il tempo di lettura in minuti di quel post o pagina

source: Post Read Time
it_it: Tempo di lettura

source: Settings
it_it: Impostazioni

source: Post read time
it_it: Tempo di lettura Articolo

source: Calculate and add reading time in minute to posts.
it_it: Calcola e aggiunge il tempo di lettura in minuti ad un articolo
